[
      {
        "ID": 0,
        "image": "https://cdn.shopify.com/s/files/1/1110/3248/products/hcl-un_1_2000x.png?v=1680295267",
        "product_name": "Creatine HCl™",
        "type": "creatine",
        "company": "Kaged",
        "cost": 24.99,
        "description": "Anyone looking to help build muscle and improve recovery without the need of a loading phase. Premium, patented Creatine HCl digests easy so you can achieve your goals."
      },
      {
        "ID": 2,
        "image": "https://d1vo8zfysxy97v.cloudfront.net/media/product/sf903__ve8382489c6ce9fb7f28cdddef00e6f1ece146591.png",
        "product_name": "Creatine",
        "type": "creatine",
        "company": "Thorne",
        "cost": 40.00,
        "description": "Creatine is an amino acid found mostly in your muscles and in the brain. It’s naturally produced in the body from other amino acids. Creatine is also found in foods like meats, eggs, and fish. It plays a vital role in the body’s production of cellular energy by helping to make ATP, a molecule needed for intense exercise, as well as for supplying the energy to pump your heart and power your brain.* "
      },
      {
        "ID": 3,
        "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcS_Kxj_UErw8xKDO8ujh2FWpcfU2BVA8GChdh2vzroCynm6AKjofwMIb9OAsL7LWccR9Zb76bWttq7z382_gUq-R3tx79HyyDdD17tp&usqp=CAc",
        "product_name": "Micronized Creatine Monohydrate",
        "type": "creatine",
        "company": "1st phorm",
        "cost": 39.99,
        "description": "One of the best selling, most researched supplements on the market, creatine made a name for itself as a proven performer back in the 1990’s. Researchers found that creatine has the ability to enhance athletic performance and has helped countless athletes train harder, work out longer and bottom-line ... produce better health and fitness results."
      },
      {
        "ID": 4,
        "image": "https://legionathletics.com/wp-content/uploads/2022/09/Image-1-Carousel-Recharge30S-Watermelon.png",
        "product_name": "Recharge Post-Workout",
        "type": "creatine",
        "company": "Legion",
        "cost": 39.99,
        "description": "Get our 100% natural[1] post-workout drink with clinically effective doses[2] of scientifically proven ingredients[3] for more muscle and strength, better post-workout recovery, and less soreness.Will Recharge help you pack on brain-shrinking amounts of muscle in 30 days flat? No. Will it add another plate or two to the bar? Absolutely not. But will it help you train harder, recover faster, and gain more muscle and strength? Yes. Or your money back."
      },
      {
        "ID": 5,
        "image": "https://cdn.shopify.com/s/files/1/0866/7664/products/CREATINEHMBUNFLAVOREDFINALVIEW1-3_800x600.png?v=1669742170",
        "product_name": "CREATINE HMB",
        "type": "creatine",
        "company": "Transparent Labs",
        "cost": 49.99,
        "description": "StrengthSeries Creatine HMB includes ingredients at clinically effective dosages and contains zero artificial sweeteners, colored dyes, unnecessary fillers, or harmful additives. When combined, Creatine monohydrate and HMB have been shown to enhance strength, increase endurance, decrease fat mass, and prevent lean muscle loss. The added BioPerine® increases bioavailability and absorption."
      }
]