[
  {
      "ID": 0,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw1cbe123d/hi-res/527922_web_GHOST_Whey%20PB%20Cereal%20Milk_Front.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "WHEY Protein Powder",
      "type": "protein",
      "company": "GHOST®",
      "cost": 44.99,
      "description": "GHOST WHEY Protein was conceived to feed savagery around the clock*, and can be enjoyed during breakfast, post workout, throughout the day or before bed. GHOST WHEY is versatile and can be used in smoothies, oats, protein ice cream, pancakes and baked goods. This formula provides 25g protein with 2g sugar and 140 calories per serving."
    },
    {
      "ID": 1,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw50a887f6/hi-res/012346_GNC_AMP_Wheybolic_Classic_Vanilla_Tub.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Wheybolic™ Whey Protein",
      "type": "protein",
      "company": "GNC AMP",
      "cost": 69.99,
      "description": "When you need a protein supplement that fits in with your weekly workout schedule, turn to GNC AMP Wheybolic™. More than just standard whey protein, this enhanced dietary supplement contains ultra-pure, fast-digesting whey protein isolate and hydrolysates that contribute to muscle growth and recovery^*, as well as improved strength and post-training anabolic response. ▪◆* Plus, you can use this supplement before or after workouts and cardio, or even on non-training days and between meals, depending on your individual needs."
    },
    {
      "ID": 2,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwec6d50db/hi-res/350283_web_Optimum%20Nutrition%20GSW_5LB_VanillaIceCream_Front_.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Gold Standard® 100% Whey Protein",
      "type": "protein",
      "company": "OPTIMUM NUTRITION",
      "cost": 49.99,
      "description": "Whey Protein Isolates (WPIs) are the purest form of whey protein that currently exists. WPIs are costly to use, but rate among the best proteins that money can buy. That's why they're the first ingredient you read on the Gold Standard 100% Whey™ label. By using WPI as the primary ingredient along with premium ultra-filtered whey protein concentrate (WPC), we're able to pack 24 grams of protein into every serving to support your muscle building needs after training. ON's attention to detail also extends to mixability. This superior quality powder has been instantized to mix easliy using a shaker cup or just a glass and spoon. There's no doubt that this is the standard by which all other whey proteins are measured."
    },
    {
      "ID": 3,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwb5200c51/hi-res/542520_web_Vital%20Proteins%20Collagen%20Peptides_Front.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Collagen Peptides Supplement ",
      "type": "protein",
      "company": "VITAL PROTEINS®",
      "cost": 46.99,
      "description": "Vital Proteins Collagen Peptides - Unflavored are sourced from grass-fed, pasture-raised bovine hides to ensure a high-quality source of this ancient nutrient. Collagen is the most abundant protein in the body supporting the health and vitality of your skin, hair, nails, bones and joints.* Collagen helps to maintain healthy joints and supports bone strength.* It also enhances skin hydration, can improve skin elasticity, and helps to maintain firm skin*. Vital Proteins peptides are easily digestible and soluble in cold or hot liquids."
    },
    {
      "ID": 4,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwc77ae269/hi-res/533853_web_Pro%20Jym%20Ultra%20Premium%20Blend%20Rocky%20Road_Front_Tub%20(2).jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Ultra-Premium Protein Powder Blend",
      "type": "protein",
      "company": "JYM®",
      "cost": 69.99,
      "description": "My Pro JYM protein powder is made from the highest-quality sources of protein. That's why I list the precise amount of each type of protein that is in every scoop of Pro JYM. Research confirms that the best gains in lean muscle mass are achieved with a protein blend that includes a fast-digesting protein (whey protein), a moderate-digesting protein (egg protein) and a slow-digesting protein (casein protein).* These are the three protein sources that make up my Pro JYM protein blend. I optimized the amount of each one to maximize my own results as well as yours."
    },
    {
      "ID": 5,
      "image": "https://m.media-amazon.com/images/I/712Sf1t-ceL._AC_SS450_.jpg",
      "product_name": "ISO100 Hydrolyzed Protein Powder",
      "type": "protein",
      "company": "Dymatize",
      "cost": 35.99,
      "description": "ISO100 is simply muscle-building fuel. Each serving contains 25 grams of protein and 5.5g of BCAAs including 2.7g of L-Leucine. Known worldwide for quality, taste and purity, ISO100 is produced to our highest quality standards. ISO100 is formulated using a cross-flow micro filtration, multi-step purification process that preserves important muscle-building protein fractions while removing excess carbohydrates, fat, lactose and cholesterol. ISO100 is made with pre-hydrolyzed protein sources to ensure fast digestion and absorption."
    },
    {
      "ID": 6,
      "image": "https://images-na.ssl-images-amazon.com/images/I/617sIhT7C7L._AC_UL232_SR232,232_.jpg",
      "product_name": "Grass Fed 100% Whey Protein",
      "type": "protein",
      "company": "Levels",
      "cost": 49.95,
      "description": "LEVELS WHEY PROTEIN: Each scoop of Levels Vanilla Bean Whey contains 24g Protein, 5.4g BCAAs (branched-chain amino acids), and no added sugars. Trusted by athletes, fitness enthusiasts and daily grinders everywhere, our whey is crafted for everyone’s lifestyle."
    },
    {
      "ID": 7,
      "image": "https://m.media-amazon.com/images/I/61M-jSrUGoL._AC_SS450_.jpg",
      "product_name": "Quest Protein Powder",
      "type": "protein",
      "company": "Quest Nutrition",
      "cost": 38.99,
      "description": "Quest Protein Powders use a unique blend of complete dairy-based protein isolates: fast absorbing whey protein isolate combined with slow-acting micellar casein and milk protein isolate to provide your body with all nine of the amino acids it needs."
    },
    {
      "ID": 8,
      "image": "https://cdn.shopify.com/s/files/1/0072/7754/3493/products/Level-1VanillaIceCream-WEB_1_2000x.jpg?v=1676845003",
      "product_name": "Meal Replacement Protein Powder",
      "type": "protein",
      "company": "1st Phorm",
      "cost": 59.99,
      "description": "Level-1 is comprised of the Level-1 Matrix which is a bioavailable, sustained assimilation protein formula* consisting of Low Temperature Processed Cross-Flow Micro Filtrated Whey Protein Isolate, Low Temperature Processed Micro-Filtrated Whey Protein Concentrate and Low Temperature Processed Milk Protein Concentrate. The Level-1 Matrix is specifically formulated to deliver premium proteins in a sustained release which mimics the protein assimilation rates of whole food."
    },
   {
      "ID": 9,
      "image": "https://cdn.shopify.com/s/files/1/1110/3248/products/WPI-C_2000x.png?v=1657921078",
      "product_name": "Whey Protein Isolate",
      "type": "protein",
      "company": "Kaged",
      "cost": 59.99,
      "description": "High quality protein powder with 25g of protein and 12g of EAAs. This protein powder has no flavors or colors from artificial sources, 1g sugar, gluten-free, and is non-GMO. It has been third party tested for quality, purity and safety."
    },
    {
      "ID": 10,
      "image": "https://legionathletics.com/wp-content/uploads/2022/11/Image-1-Carousel-Whey-2lb-Pumpkin-Pie-1000x1000-1.png",
      "product_name": "Recharge Post-Workout",
      "type": "protein",
      "company": "Legion",
      "cost": 53.99,
      "description": "Is Whey+ an “anabolic feast” for maximizing muscle growth? No. Will it supercharge your workouts and recovery? Absolutely not. But will it help you eat enough high-quality protein rich in all 9 essential amino acids to keep gaining muscle and strength? And without bloating, gassiness, or stomach aches? Yes. Or your money back. Made with pure Truly Grass Fed™ milk from hormone- and antibiotic-free cows that live the way nature intended—outside, roaming and grazing on grass. Total transformation transparency (no proprietary blends). Certified to contain no banned substances by Labdoor™, the gold standard of third-party lab testing. Made in the USA in NSF-certified and FDA-inspected and cGMP-compliant facilities"
    },
    {
      "ID": 11,
      "image": "https://legionathletics.com/wp-content/uploads/2022/11/Image-1-Carousel-Casein-Banana-Creampie-1000x1000-1.png",
      "product_name": "Casein Protein Powder",
      "type": "protein",
      "company": "Legion",
      "cost": 59.99,
      "description": "Micellar casein is a form of casein protein that has been produced in a way that maximally preserves its slow-digesting properties. It’s the highest quality casein protein powder you can buy and has a stellar amino acid profile, providing you with 11.4 grams of essential amino acids per serving. Casein+ is also made with pure Truly Grass Fed™ casein protein, which is made with milk from hormone- and antibiotic-free cows that live the way nature intended—outside, roaming and grazing on grass."
    },
    {
      "ID": 12,
      "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.94/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw2a167019/hi-res/350156_1.jpg?sw=480&sh=480&sm=fit&yocs=19_1c_",
      "product_name": "Gold Standard 100% Casein™",
      "type": "protein",
      "company": "Optimum Nutrition ",
      "cost": 59.99,
      "description": "Rapid protein use is desirable immediately before and after exercise to help refuel recovering muscles, but delayed digestion and absorption may be more beneficial at other times – including bedtime when your body typically goes for hours without food. Casein proteins are acid sensitive and tend to thicken in the stomach. Because of this, it can take more than twice as long for our Gold Standard 100% Casein to be broken down into it’s amino acid subcomponents than other proteins. By blending premium micellar and calcium caseins, we’ve created a protein formula that’s truly time-released."
    },
    {
      "ID": 13,
      "image": "https://static.thcdn.com/images/large/original//productimg/1600/1600/10852500-7324987878090111.jpg",
      "product_name": "Impact Whey Protein",
      "type": "protein",
      "company": "My Protein",
      "cost": 44.99,
      "description": "Our Impact Whey is a perfect source of everyday protein with over 80% protein content and naturally occurring BCAAs to help build and repair new muscle."
    },
    {
      "id": 0,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwf0cd0353/hi-res/533872_web_Jym%20Pre%20Workout%20Pink%20Lemonade%2030%20count_Front.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Pre-Workout Supplement",
      "type": "pre-workout",
      "company": "JYM®",
      "cost": 54.99,
      "description": "I’ve taken the decades I’ve spent in spent in school, the lab, the gym, and the kitchen distilled them into the very product you hold in your hands. I formulated every JYM Supplement Science product to include the same ingredients at the exact amount. I use to reap the maximum performance and physique benefits. It's my hope that you too, will experience similar results*"
    },
    {
      "id": 1,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw5eac8253/hi-res/369881_Beyond_Raw_Lit_Strawberry_Lemonade_Tub.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Beyond Raw® LIT™ Pre-Workout",
      "type": "pre-workout",
      "company": "BEYOND RAW®",
      "cost": 44.99,
      "description": "Destroy your limitations with the best pre-workout supplements from BEYOND RAW®. BEYOND RAW LIT™ pre-workout powder is clinically dosed with caffeine for energy and endurance, creatine monohydrate to help you power bigger goals, and CarnoSyn® beta-alanine to fight fatigue and improve performance*. Because your only mode is more."
    },
    {
      "id": 2,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwfa6ea054/hi-res/527980_web_Ghost%20Legend%20Warheads_tub_Front.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "LEGEND® V2 Pre-Workout",
      "type": "pre-workout",
      "company": "GHOST®",
      "cost": 44.99,
      "description": "Feel Like A Legend When You Need It Most. GHOST LEGEND® pre-workout combines a standout energy and focus formula with premium pump ingredients to get you feeling like a legend whenever you need it most."
    },
    {
      "id": 3,
      "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.90/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw65cf97ff/hi-res/500409_1.jpg?sw=1500&sh=1500&sm=fit&yocs=19_",
      "product_name": "Bucked Up® Pre-Workout",
      "type": "pre-workout",
      "company": "BUCKED UP®",
      "cost": 49.99,
      "description": "DAS Labs presents Bucked Up, a game-changing formula set to revolutionize pre-workout. This scientifically tested, non-proprietary blend with no fillers, is loaded with the most essential ingredients, including three growth hormone potentiates, to help enhance your workout. "
    },
    {
      "id": 4,
      "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.90/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw0ec1124e/hi-res/561546_Alani_Nu_Pre_Workout_Juicy_Peach_Front.jpg?sw=1500&sh=1500&sm=fit&yocs=19_",
      "product_name": "Alani Nu Pre-Workout",
      "type": "pre-workout",
      "company": "ALANI NU",
      "cost": 44.99,
      "description": "Alani Nu believes that the largest gain comes from that last rep, set or mile. When you push through, you’re victorious. Alani Nu Pre-Workout Powder - Galaxy Lemonade provides the perfect amount of endurance to power through those moments that matter most. We provide 30 servings of this flavor-packed formula to ensure that you don’t miss a beat and get the most out of every single workout. Enjoy this sports supplement in a variety of delicious and unique flavors!"
    },
    {
      "id": 5,
      "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw7c964583/hi-res/548826_web_Redcon1%20TotalWar%20Blue%20Lemonade_Front.jpg?sw=1500&sh=1500&sm=fit",
      "product_name": "Total War Pre-Workout",
      "type": "pre-workout",
      "company": "REDCON1",
      "cost": 44.99,
      "description": "When it's time to go to battle, you go hard with Total War®. Experience a workout with intensity you didn't think was possible. New found strength and energy are just minutes away. Lock-in and get ready to bring the noise!"
    },
    {
      "id": 6,
      "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.90/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwdc6297d7/hi-res/447861_1.jpg?sw=1500&sh=1500&sm=fit&yocs=19_",
      "product_name": "C4® Original Pre-Workout",
      "type": "pre-workout",
      "company": "CELLUCOR®",
      "cost": 34.99,
      "description": "C4® Original – Fruit Punch is Cellucor’s most popular pre-workout powder. With ingredients like creatine nitrate, TeaCrine®, beta-alanine, arginine alpha ketoglutarate and caffeine, C4® Original will continue to deliver explosive energy and focus to help push you through your next workout.*"
    },
    {
      "id": 7,
      "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.90/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwe3b16e51/hi-res/410699_web_GAT%20Sport%20Nitraflex%20Preworkout%20Green%20Apple_Front.jpg?sw=1500&sh=1500&sm=fit&yocs=19_",
      "product_name": "Sport NITRAFLEX® Pre-Workout",
      "type": "pre-workout",
      "company": "GAT® SPORT",
      "cost": 44.99,
      "description": "For nearly a decade, NITRAFLEX® has been the name you trust when it comes to pre-workout formulas. And now, NITRAFLEX ups the ante by introducing Nitrosigine to the mix, and adding even more pure Citrulline to the formula. This 1-2 punch  greatly increases pumps beyond expectations. The volume has been turned up on the energy, focus and flavor as well. Lastly, there's no more artificial dyes in the formulas. All in all, this is the strongest and best-tasting NITRAFLEX yet!"
    },
    {
      "id": 8,
      "image": "https://cdn.shopify.com/s/files/1/1110/3248/products/pk-pl1_600x.png?v=1680298499",
      "product_name": "Pre-Kaged®",
      "type": "pre-workout",
      "company": "Kaged",
      "cost": 44.99,
      "description": "Pre-Kaged is the Ultimate Pre-Workout to provide the best focus, pump, and stamina in the gym. Full label disclosure combined with premium, patented ingredients to crush your next workout! Also suitable for Vegan/Vegetarian Diets."
    },
    {
      "ID": 9,
      "image": "https://legionathletics.com/wp-content/uploads/2022/11/Pulse20S-Apple-Cider.png",
      "product_name": "Pulse Natural Pre-Workout",
      "type": "pre-workout",
      "company": "Legion",
      "cost": 44.99,
      "description": "Many of us can’t shake the cobwebs without our morning cup of coffee, but this powerful compound is a lot more than a mere pick-me-up. Caffeine also boosts metabolism, improves strength, promotes muscle endurance, and enhances anaerobic performance. The clinically effective dose of caffeine for enhancing performance is between 3 and 6 milligrams per kilogram of body weight.[14]"
    },
    {
      "ID": 10,
      "image": "https://cdn.shopify.com/s/files/1/2321/6571/products/SuperhumanPRELionsblood1bottle.png?v=1669676789",
      "product_name": "SUPERHUMAN® PRE",
      "type": "pre-workout",
      "company": "Alpha Lion",
      "cost": 49.99,
      "description": "The original, high- performance pre-workout that is the gold standard of training intensity. Its jam-packed but well-rounded formula is the perfect solution for anyone struggling with gym motivation or stagnant workouts. Superhuman Pre-Workout provides long-lasting, all-day energy powered by our novel SXT™ Energy and Focus System. Combining THREE different caffeines to promote a fast-acting and sustained energy experience that minimizes the 'spike and crash' effect with traditional pre-workouts."
    },
    {
      "ID": 0,
      "image": "https://cdn.shopify.com/s/files/1/1110/3248/products/hcl-un_1_2000x.png?v=1680295267",
      "product_name": "Creatine HCl™",
      "type": "creatine",
      "company": "Kaged",
      "cost": 24.99,
      "description": "Anyone looking to help build muscle and improve recovery without the need of a loading phase. Premium, patented Creatine HCl digests easy so you can achieve your goals."
    },
    {
      "ID": 2,
      "image": "https://d1vo8zfysxy97v.cloudfront.net/media/product/sf903__ve8382489c6ce9fb7f28cdddef00e6f1ece146591.png",
      "product_name": "Creatine",
      "type": "creatine",
      "company": "Thorne",
      "cost": 40.00,
      "description": "Creatine is an amino acid found mostly in your muscles and in the brain. It’s naturally produced in the body from other amino acids. Creatine is also found in foods like meats, eggs, and fish. It plays a vital role in the body’s production of cellular energy by helping to make ATP, a molecule needed for intense exercise, as well as for supplying the energy to pump your heart and power your brain.* "
    },
    {
      "ID": 3,
      "image": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcS_Kxj_UErw8xKDO8ujh2FWpcfU2BVA8GChdh2vzroCynm6AKjofwMIb9OAsL7LWccR9Zb76bWttq7z382_gUq-R3tx79HyyDdD17tp&usqp=CAc",
      "product_name": "Micronized Creatine Monohydrate",
      "type": "creatine",
      "company": "1st phorm",
      "cost": 39.99,
      "description": "One of the best selling, most researched supplements on the market, creatine made a name for itself as a proven performer back in the 1990’s. Researchers found that creatine has the ability to enhance athletic performance and has helped countless athletes train harder, work out longer and bottom-line ... produce better health and fitness results."
    },
    {
      "ID": 4,
      "image": "https://legionathletics.com/wp-content/uploads/2022/09/Image-1-Carousel-Recharge30S-Watermelon.png",
      "product_name": "Recharge Post-Workout",
      "type": "creatine",
      "company": "Legion",
      "cost": 39.99,
      "description": "Get our 100% natural[1] post-workout drink with clinically effective doses[2] of scientifically proven ingredients[3] for more muscle and strength, better post-workout recovery, and less soreness.Will Recharge help you pack on brain-shrinking amounts of muscle in 30 days flat? No. Will it add another plate or two to the bar? Absolutely not. But will it help you train harder, recover faster, and gain more muscle and strength? Yes. Or your money back."
    },
    {
      "ID": 5,
      "image": "https://cdn.shopify.com/s/files/1/0866/7664/products/CREATINEHMBUNFLAVOREDFINALVIEW1-3_800x600.png?v=1669742170",
      "product_name": "CREATINE HMB",
      "type": "creatine",
      "company": "Transparent Labs",
      "cost": 49.99,
      "description": "StrengthSeries Creatine HMB includes ingredients at clinically effective dosages and contains zero artificial sweeteners, colored dyes, unnecessary fillers, or harmful additives. When combined, Creatine monohydrate and HMB have been shown to enhance strength, increase endurance, decrease fat mass, and prevent lean muscle loss. The added BioPerine® increases bioavailability and absorption."
    }

]