[
    {
        "ID": 0,
        "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw1cbe123d/hi-res/527922_web_GHOST_Whey%20PB%20Cereal%20Milk_Front.jpg?sw=1500&sh=1500&sm=fit",
        "product_name": "WHEY Protein Powder",
        "type": "protein",
        "company": "GHOST®",
        "cost": 44.99,
        "description": "GHOST WHEY Protein was conceived to feed savagery around the clock*, and can be enjoyed during breakfast, post workout, throughout the day or before bed. GHOST WHEY is versatile and can be used in smoothies, oats, protein ice cream, pancakes and baked goods. This formula provides 25g protein with 2g sugar and 140 calories per serving."
      },
      {
        "ID": 1,
        "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw50a887f6/hi-res/012346_GNC_AMP_Wheybolic_Classic_Vanilla_Tub.jpg?sw=1500&sh=1500&sm=fit",
        "product_name": "Wheybolic™ Whey Protein",
        "type": "protein",
        "company": "GNC AMP",
        "cost": 69.99,
        "description": "When you need a protein supplement that fits in with your weekly workout schedule, turn to GNC AMP Wheybolic™. More than just standard whey protein, this enhanced dietary supplement contains ultra-pure, fast-digesting whey protein isolate and hydrolysates that contribute to muscle growth and recovery^*, as well as improved strength and post-training anabolic response. ▪◆* Plus, you can use this supplement before or after workouts and cardio, or even on non-training days and between meals, depending on your individual needs."
      },
      {
        "ID": 2,
        "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwec6d50db/hi-res/350283_web_Optimum%20Nutrition%20GSW_5LB_VanillaIceCream_Front_.jpg?sw=1500&sh=1500&sm=fit",
        "product_name": "Gold Standard® 100% Whey Protein",
        "type": "protein",
        "company": "OPTIMUM NUTRITION",
        "cost": 49.99,
        "description": "Whey Protein Isolates (WPIs) are the purest form of whey protein that currently exists. WPIs are costly to use, but rate among the best proteins that money can buy. That's why they're the first ingredient you read on the Gold Standard 100% Whey™ label. By using WPI as the primary ingredient along with premium ultra-filtered whey protein concentrate (WPC), we're able to pack 24 grams of protein into every serving to support your muscle building needs after training. ON's attention to detail also extends to mixability. This superior quality powder has been instantized to mix easliy using a shaker cup or just a glass and spoon. There's no doubt that this is the standard by which all other whey proteins are measured."
      },
      {
        "ID": 3,
        "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwb5200c51/hi-res/542520_web_Vital%20Proteins%20Collagen%20Peptides_Front.jpg?sw=1500&sh=1500&sm=fit",
        "product_name": "Collagen Peptides Supplement ",
        "type": "protein",
        "company": "VITAL PROTEINS®",
        "cost": 46.99,
        "description": "Vital Proteins Collagen Peptides - Unflavored are sourced from grass-fed, pasture-raised bovine hides to ensure a high-quality source of this ancient nutrient. Collagen is the most abundant protein in the body supporting the health and vitality of your skin, hair, nails, bones and joints.* Collagen helps to maintain healthy joints and supports bone strength.* It also enhances skin hydration, can improve skin elasticity, and helps to maintain firm skin*. Vital Proteins peptides are easily digestible and soluble in cold or hot liquids."
      },
      {
        "ID": 4,
        "image": "https://www.gnc.com/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dwc77ae269/hi-res/533853_web_Pro%20Jym%20Ultra%20Premium%20Blend%20Rocky%20Road_Front_Tub%20(2).jpg?sw=1500&sh=1500&sm=fit",
        "product_name": "Ultra-Premium Protein Powder Blend",
        "type": "protein",
        "company": "JYM®",
        "cost": 69.99,
        "description": "My Pro JYM protein powder is made from the highest-quality sources of protein. That's why I list the precise amount of each type of protein that is in every scoop of Pro JYM. Research confirms that the best gains in lean muscle mass are achieved with a protein blend that includes a fast-digesting protein (whey protein), a moderate-digesting protein (egg protein) and a slow-digesting protein (casein protein).* These are the three protein sources that make up my Pro JYM protein blend. I optimized the amount of each one to maximize my own results as well as yours."
      },
      {
        "ID": 5,
        "image": "https://m.media-amazon.com/images/I/712Sf1t-ceL._AC_SS450_.jpg",
        "product_name": "ISO100 Hydrolyzed Protein Powder",
        "type": "protein",
        "company": "Dymatize",
        "cost": 35.99,
        "description": "ISO100 is simply muscle-building fuel. Each serving contains 25 grams of protein and 5.5g of BCAAs including 2.7g of L-Leucine. Known worldwide for quality, taste and purity, ISO100 is produced to our highest quality standards. ISO100 is formulated using a cross-flow micro filtration, multi-step purification process that preserves important muscle-building protein fractions while removing excess carbohydrates, fat, lactose and cholesterol. ISO100 is made with pre-hydrolyzed protein sources to ensure fast digestion and absorption."
      },
      {
        "ID": 6,
        "image": "https://images-na.ssl-images-amazon.com/images/I/617sIhT7C7L._AC_UL232_SR232,232_.jpg",
        "product_name": "Grass Fed 100% Whey Protein",
        "type": "protein",
        "company": "Levels",
        "cost": 49.95,
        "description": "LEVELS WHEY PROTEIN: Each scoop of Levels Vanilla Bean Whey contains 24g Protein, 5.4g BCAAs (branched-chain amino acids), and no added sugars. Trusted by athletes, fitness enthusiasts and daily grinders everywhere, our whey is crafted for everyone’s lifestyle."
      },
      {
        "ID": 7,
        "image": "https://m.media-amazon.com/images/I/61M-jSrUGoL._AC_SS450_.jpg",
        "product_name": "Quest Protein Powder",
        "type": "protein",
        "company": "Quest Nutrition",
        "cost": 38.99,
        "description": "Quest Protein Powders use a unique blend of complete dairy-based protein isolates: fast absorbing whey protein isolate combined with slow-acting micellar casein and milk protein isolate to provide your body with all nine of the amino acids it needs."
      },
      {
        "ID": 8,
        "image": "https://cdn.shopify.com/s/files/1/0072/7754/3493/products/Level-1VanillaIceCream-WEB_1_2000x.jpg?v=1676845003",
        "product_name": "Meal Replacement Protein Powder",
        "type": "protein",
        "company": "1st Phorm",
        "cost": 59.99,
        "description": "Level-1 is comprised of the Level-1 Matrix which is a bioavailable, sustained assimilation protein formula* consisting of Low Temperature Processed Cross-Flow Micro Filtrated Whey Protein Isolate, Low Temperature Processed Micro-Filtrated Whey Protein Concentrate and Low Temperature Processed Milk Protein Concentrate. The Level-1 Matrix is specifically formulated to deliver premium proteins in a sustained release which mimics the protein assimilation rates of whole food."
      },
     {
        "ID": 9,
        "image": "https://cdn.shopify.com/s/files/1/1110/3248/products/WPI-C_2000x.png?v=1657921078",
        "product_name": "Whey Protein Isolate",
        "type": "protein",
        "company": "Kaged",
        "cost": 59.99,
        "description": "High quality protein powder with 25g of protein and 12g of EAAs. This protein powder has no flavors or colors from artificial sources, 1g sugar, gluten-free, and is non-GMO. It has been third party tested for quality, purity and safety."
      },
      {
        "ID": 10,
        "image": "https://legionathletics.com/wp-content/uploads/2022/11/Image-1-Carousel-Whey-2lb-Pumpkin-Pie-1000x1000-1.png",
        "product_name": "Recharge Post-Workout",
        "type": "protein",
        "company": "Legion",
        "cost": 53.99,
        "description": "Is Whey+ an “anabolic feast” for maximizing muscle growth? No. Will it supercharge your workouts and recovery? Absolutely not. But will it help you eat enough high-quality protein rich in all 9 essential amino acids to keep gaining muscle and strength? And without bloating, gassiness, or stomach aches? Yes. Or your money back. Made with pure Truly Grass Fed™ milk from hormone- and antibiotic-free cows that live the way nature intended—outside, roaming and grazing on grass. Total transformation transparency (no proprietary blends). Certified to contain no banned substances by Labdoor™, the gold standard of third-party lab testing. Made in the USA in NSF-certified and FDA-inspected and cGMP-compliant facilities"
      },
      {
        "ID": 11,
        "image": "https://legionathletics.com/wp-content/uploads/2022/11/Image-1-Carousel-Casein-Banana-Creampie-1000x1000-1.png",
        "product_name": "Casein Protein Powder",
        "type": "protein",
        "company": "Legion",
        "cost": 59.99,
        "description": "Micellar casein is a form of casein protein that has been produced in a way that maximally preserves its slow-digesting properties. It’s the highest quality casein protein powder you can buy and has a stellar amino acid profile, providing you with 11.4 grams of essential amino acids per serving. Casein+ is also made with pure Truly Grass Fed™ casein protein, which is made with milk from hormone- and antibiotic-free cows that live the way nature intended—outside, roaming and grazing on grass."
      },
      {
        "ID": 12,
        "image": "https://cdn-fsly.yottaa.net/5b9fc7760b534475fab84ce9/www.gnc.com/v~4b.94/dw/image/v2/BBLB_PRD/on/demandware.static/-/Sites-master-catalog-gnc/default/dw2a167019/hi-res/350156_1.jpg?sw=480&sh=480&sm=fit&yocs=19_1c_",
        "product_name": "Gold Standard 100% Casein™",
        "type": "protein",
        "company": "Optimum Nutrition ",
        "cost": 59.99,
        "description": "Rapid protein use is desirable immediately before and after exercise to help refuel recovering muscles, but delayed digestion and absorption may be more beneficial at other times – including bedtime when your body typically goes for hours without food. Casein proteins are acid sensitive and tend to thicken in the stomach. Because of this, it can take more than twice as long for our Gold Standard 100% Casein to be broken down into it’s amino acid subcomponents than other proteins. By blending premium micellar and calcium caseins, we’ve created a protein formula that’s truly time-released."
      },
      {
        "ID": 13,
        "image": "https://static.thcdn.com/images/large/original//productimg/1600/1600/10852500-7324987878090111.jpg",
        "product_name": "Impact Whey Protein",
        "type": "protein",
        "company": "My Protein",
        "cost": 44.99,
        "description": "Our Impact Whey is a perfect source of everyday protein with over 80% protein content and naturally occurring BCAAs to help build and repair new muscle."
      }

]